app/Models/ModelPenjualan.php

    public function CekProduk($kode_produk)
    {
        return $this->db->table('tbl_produk')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori=tbl_produk.id_kategori')
            ->join('tbl_satuan', 'tbl_satuan.id_satuan=tbl_produk.id_satuan')
            ->where('kode_produk', $kode_produk)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`=`tbl_produk`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan`=`tbl_produk`.`id_satuan`
WHERE `kode_produk` = '55555'

    public function AllProduk()
    {
        return $this->db->table('tbl_produk')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori=tbl_produk.id_kategori')
            ->join('tbl_satuan', 'tbl_satuan.id_satuan=tbl_produk.id_satuan')
            ->where('stok > 0')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`=`tbl_produk`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan`=`tbl_produk`.`id_satuan`
WHERE `stok` > 0

    public function InsertJual($data)
    {
        $this->db->table('tbl_jual')->insert($data);
---
INSERT INTO `tbl_jual` (`no_faktur`, `tgl_jual`, `jam`, `grand_total`, `dibayar`, `kembalian`, `id_user`) VALUES ('202410140002', '2024-10-14', '11:39:13', 49500, '50000', '-44500', '4')

    public function InsertRinciJual($data)
    {
        $this->db->table('tbl_rinci_jual')->insert($data);
---
INSERT INTO `tbl_rinci_jual` (`no_faktur`, `kode_produk`, `harga`, `modal`, `qty`, `total_harga`, `untung`) VALUES ('202410140002', '55555', 36000, '30000', 1, 36000, 6000)